from modules.server import server

# ------------------------------------------------------------- #
#                                                               #
#                      'Python Mini Server'                     #
#                                                               #
#   modules:                                                    #
#   ---------------------------------------------------------   #
#                                                               #
#       is_auth()           - проверка авторизации              #
#       server_auth()       - список файлов в каталоге          #
#       server_exit()       - выход из аккаунта                 #
#       server_fail()       - вывод ошибки неправильного        #
#                             использования.                    #
#       server_help()       - вывод справки по использованию    #
#       server_info()       - вывод информации о файле          #
#       server_list()       - вывод списка файлов каталога      #
#       server_retr()       - перемещение файла в каталог про-  #
#                             граммы                            #
#       server_auth_fail()  - вывод ошибки авторизации          #
#                                                               #
# ------------------------------------------------------------- #

# Выполнение сервера.
server()
